example1
A> 遠足いついきますか？
B> 明日はちょうど晴れなので明日はどうでしょう
A> 良いですね
A> 場所はどうしましょうか
B> 第一公園なんかはどうでしょう
A> 良いですね
A> なんの遊びをしましょうか？
B> 久しぶりに鬼ごっこでもしましょうか
A> そうしましょう
SYS> それでは明日の遠足は第一公園で鬼ごっこをやるということでよろしいでしょうか？

example2
A> 明日の遠足はどこいきますか？
B> 先週は第一公園にいきましたよね
A> そうですね
A> そうしたら明日は第二公園にしませんか？
A> そうしましょう
B> 久しぶりに鬼ごっこでもしましょうか
A> そうしましょう
SYS> それでは明日の遠足は第一公園で鬼ごっこをやるということでよろしいでしょうか？


example3



